DataProcessors/Renault_ВыгрузкаЗагрузкаЗаявокРено.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_ВыгрузкаЗагрузкаЗаявокРено</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Renault_ИсторияВыгрузкиЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ИсторияВыгрузкиЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВОбработке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ДопРеквизитыЗаказаПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ДопРеквизитыЗаказаПоставщику</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SITE</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыЗаказаПоставщику</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаказаРено</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЗаказаРено</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЗаказНаряда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыданПодменныйАвтомобиль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодменныйАвтомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_ПодменныеАвто</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиПодменногоАвтомобиля</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Renault_VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗаказаSappr</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SAPPR_ВидЗаказаПоставщику</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправлятьВRenault</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ДопТабЧастиЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ДопТабЧастиЗаказПоставщику</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВИН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ИсторияИзмененияЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ИсторияИзмененияЗаказПоставщику</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реферанс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Renault_ПараметрыПодключенияКСервисам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_ПараметрыПодключенияКСервисам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/Renault_ВыгрузкаЗагрузкаЗаявокРено/Ext/ObjectModule.bsl
Процедура ВыполнитьВыгрузкуЗаказов () Экспорт
	
	ВебСервис = ПолучитьВебСервис();
	
	сОтвет = СформироватьТаблицуДляВыгрузики ();
	Сервер = СтрокаСоединенияИнформационнойБазы();
	Если сОтвет <> Неопределено Тогда
		
		Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
		ТаблицаXDTO = Сериализатор.ЗаписатьXDTO(сОтвет.ТаблицаДанных);
		ВебСервис.Put(ТаблицаXDTO, Сервер);
		
		Для Каждого строкаМассива из сОтвет.мЗаявок Цикл
			
			Менеджер = РегистрыСведений.Renault_ИсторияВыгрузкиЗаказов.СоздатьМенеджерЗаписи();
			Менеджер.ЗаказПоставщику = строкаМассива;
			Менеджер.Прочитать();
			Менеджер.ЗаказПоставщику = строкаМассива;
			Менеджер.Отправлено = Истина;
			Менеджер.Записать();
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьВебСервис() 
	
	ДанныеПодключения = Справочники.Renault_ПараметрыПодключенияКСервисам.ПолучитьПараметрыПодключенияПоСсылке(
		Справочники.Renault_ПараметрыПодключенияКСервисам.WSGate,
		"Referans.1cws");
	Адрес = ДанныеПодключения.Адрес;
	ЛогинWS = ДанныеПодключения.Логин;
	ПарольWS = ДанныеПодключения.Пароль;
	WSОпределение = Renault_ОбщегоНазначенияПовтИсп.ОпределениеTDFa(Адрес, ЛогинWS, ПарольWS);
	ВебСервис = Новый WSПрокси(
		WSОпределение, 
		"http://v8.1c.ru/8.1/data/core", 
		"Renault_Referans", 
		"Renault_ReferansSoap12",
		3600);
	ВебСервис.Пользователь = СокрЛП(ЛогинWS);
	ВебСервис.Пароль = СокрЛП(ПарольWS);
	Возврат ВебСервис;
	
КонецФункции

Функция СформироватьТаблицуДляВыгрузики () 
	сОтвет = Новый Структура;
	мЗаявок = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокЗаказПоставщику.Ссылка,
	|	CRM_ДилерскиеЦентрыПодразделенияОрганизации.Ссылка.BIR,
	|	CRM_ДилерскиеЦентрыПодразделенияОрганизации.Ссылка КАК ДилерскийЦентр,
	|	Renault_ДопРеквизитыЗаказаПоставщику.ПодменныйАвтомобиль,
	|	Renault_ДопРеквизитыЗаказаПоставщику.ДатаВыдачиПодменногоАвтомобиля
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ДокЗаказПоставщику
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_ДилерскиеЦентры.ПодразделенияОрганизации КАК CRM_ДилерскиеЦентрыПодразделенияОрганизации
	|		ПО ДокЗаказПоставщику.Ссылка.ПодразделениеКомпании = CRM_ДилерскиеЦентрыПодразделенияОрганизации.Подразделение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ДопРеквизитыЗаказаПоставщику КАК Renault_ДопРеквизитыЗаказаПоставщику
	|		ПО (Renault_ДопРеквизитыЗаказаПоставщику.ЗаказПоставщику = ДокЗаказПоставщику.Ссылка)
	|ГДЕ
	|	НЕ ДокЗаказПоставщику.Ссылка В
	|				(ВЫБРАТЬ
	|					Renault_ИсторияВыгрузкиЗаказов.ЗаказПоставщику
	|				ИЗ
	|					РегистрСведений.Renault_ИсторияВыгрузкиЗаказов КАК Renault_ИсторияВыгрузкиЗаказов
	|				ГДЕ
	|					Renault_ИсторияВыгрузкиЗаказов.Отправлено)
	|	И ДокЗаказПоставщику.Проведен
	|	И Renault_ДопРеквизитыЗаказаПоставщику.ОтправлятьВRenault";
	
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Возврат Неопределено;
	КонецЕсли; 
	ТаблицаЗаявок  = Результат.Выгрузить();
	ТаблицаЗаявок.Свернуть("Ссылка");
	мЗаявок = ТаблицаЗаявок.ВыгрузитьКолонку("Ссылка");
	мИсключений = Новый Массив;
	Для Каждого строкаМассива из мЗаявок цикл
		Менеджер = РегистрыСведений.Renault_ИсторияВыгрузкиЗаказов.СоздатьМенеджерЗаписи();
		Менеджер.ЗаказПоставщику = строкаМассива;
		Менеджер.Прочитать();
		Менеджер.ЗаказПоставщику = строкаМассива;
		Менеджер.ВОбработке = Истина;
		Менеджер.Записать();
	КонецЦикла;

	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("НомерЗаказа");
	ТаблицаДанных.Колонки.Добавить("ДатаЗаказа");
	ТаблицаДанных.Колонки.Добавить("BIR");
	ТаблицаДанных.Колонки.Добавить("СИТ");
	ТаблицаДанных.Колонки.Добавить("ТипЗаказа");
	ТаблицаДанных.Колонки.Добавить("НомерСтрокиТЧ");
	ТаблицаДанных.Колонки.Добавить("Артикул");
	ТаблицаДанных.Колонки.Добавить("Количество");
	ТаблицаДанных.Колонки.Добавить("VIN");
	ТаблицаДанных.Колонки.Добавить("VINПодменный");
	ТаблицаДанных.Колонки.Добавить("ДатаВыдачи");
	ТаблицаДанных.Колонки.Добавить("Комментарий");
	ТаблицаДанных.Колонки.Добавить("ДатаПоставки",Новый ОписаниеТипов("Дата"));
	ТаблицаДанных.Колонки.Добавить("Заявка");

	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.BIR <> NULL и мИсключений.Найти(Выборка.Ссылка) = Неопределено Тогда
			
			ТаблицаТоваров = Выборка.Ссылка.Товары;
			Набор = РегистрыСведений.Renault_ДопТабЧастиЗаказПоставщику.СоздатьНаборЗаписей();
			Набор.Отбор.ЗаказПоставщику.Установить(Выборка.Ссылка);
			Набор.Прочитать();
			ТаблицаRenault = Набор.Выгрузить();
			Для Каждого СтрокаТовар из ТаблицаТоваров Цикл
				ДопСтрока = ТаблицаRenault.Найти (СтрокаТовар.Номенклатура, "Номенклатура");
				если ДопСтрока <> Неопределено Тогда
					СтрокаДанных = ТаблицаДанных.Добавить();
					СтрокаДанных.НомерЗаказа = ?(ЗначениеЗаполнено(Renault_ОбщийМодуль.ПолучитьСИТизБИР(Выборка.BIR)), "" + Лев(Renault_ОбщийМодуль.ПолучитьСИТизБИР(Выборка.BIR),2) + Прав(Выборка.Ссылка.Номер,8),Выборка.Ссылка.Номер);
					СтрокаДанных.ДатаЗаказа = Выборка.Ссылка.Дата;
					СтрокаДанных.BIR = Renault_ОбщийМодуль.ПолучитьСИТизБИР(Выборка.BIR);
					СтрокаДанных.СИТ = Renault_ОбщийМодуль.ПолучитьСИТизБИР(Выборка.BIR);
					СтрокаДанных.ТипЗаказа = Справочники.ТипыЗаказов.ПолучитьИмяПредопределенного(Выборка.Ссылка.ТипЗаказа);
					СтрокаДанных.НомерСтрокиТЧ = СтрокаТовар.НомерСтроки;
					СтрокаДанных.Артикул = СтрокаТовар.Номенклатура.Артикул;
					СтрокаДанных.Количество = СтрокаТовар.Количество;
					СтрокаДанных.VIN = ДопСтрока.Вин;
					СтрокаДанных.VINПодменный = Выборка.ПодменныйАвтомобиль.Автомобиль.VIN;
					СтрокаДанных.ДатаВыдачи = Выборка.ДатаВыдачиПодменногоАвтомобиля;
					СтрокаДанных.Комментарий = ДопСтрока.Комментарий;
					Если Выборка.Ссылка.ТипЗаказа = Справочники.ТипыЗаказов.ZMP4Складской 
						или Выборка.Ссылка.ТипЗаказа = Справочники.ТипыЗаказов.ZMP4ПрямаяПоставка
							или Выборка.Ссылка.ТипЗаказа = Справочники.ТипыЗаказов.ZMP9Промо Тогда
						СтрокаДанных.ДатаПоставки = Выборка.Ссылка.СрокПоставки;
					КонецЕсли;
					СтрокаДанных.Заявка = Выборка.Ссылка.УникальныйИдентификатор();
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	сОтвет.Вставить("ТаблицаДанных", ТаблицаДанных);
	сОтвет.Вставить("мЗаявок", мЗаявок);
	Возврат сОтвет;
	
КонецФункции

Процедура ВыполнитьЗагрузкуЗаявок () Экспорт
	
	ВебСервис = ПолучитьВебСервис();
	Сервер = СтрокаСоединенияИнформационнойБазы();
	Выборка = Справочники.CRM_ДилерскиеЦентры.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОбъектXDTO = ВебСервис.GetStatus(Выборка.Ссылка.УникальныйИдентификатор(), Сервер);
		Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
		ТаблицаДанных = Сериализатор.ПрочитатьXDTO(ОбъектXDTO);
		МассивОбработанных = Новый Массив;
		Для Каждого Пакет из ТаблицаДанных Цикл
			Попытка
				ДвоичныеДанныеФайла = Пакет.Данные.Получить();
				ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
				ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);
				ЧтениеXML = Новый ЧтениеXML;
				ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
				ЧтениеXML.Прочитать();
				ЧтениеXML.Прочитать(); // пропуск тэга Message
				Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
					ТипXDTO = ВебСервис.ФабрикаXDTO.Тип(Пакет.ПространствоИменДанных, ЧтениеXML.Имя);
					ОбъектXDTO = ВебСервис.ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипXDTO); 
					Отказ = ЗагрузитьСтатусЗаказа(ОбъектXDTO);
				КонецЦикла;
				ЧтениеXML.Закрыть();
				УдалитьФайлы(ИмяВременногоФайла);
				Если Не Отказ Тогда
					МассивОбработанных.Добавить(Пакет.МоментВремени);
				КонецЕсли;
			Исключение
				Инфо = ИнформацияОбОшибке();
				ИнфоПодробное = ПодробноеПредставлениеОшибки(Инфо);
				сфСообщитьОбОшибке(ОписаниеОшибки());
				ВызватьИсключение;
			КонецПопытки;
		КонецЦикла;
		МассивОбработанныхОбъектXDTO = Сериализатор.ЗаписатьXDTO(МассивОбработанных);
		ВебСервис.ConfirmStatus(МассивОбработанныхОбъектXDTO, Выборка.Ссылка.УникальныйИдентификатор());
	КонецЦикла;

КонецПроцедуры

Функция ЗагрузитьСтатусЗаказа (ОбъектXDTO)
	
	Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
	ТаблицаСтатусов = Сериализатор.ПрочитатьXDTO(ОбъектXDTO);
	
	ТаблицаРеферансов = Новый ТаблицаЗначений;
	ТаблицаРеферансов.Колонки.Добавить("ЗаказДокумент", Новый ОписаниеТипов("ДокументСсылка.ЗаказПоставщику"));
	ТаблицаРеферансов.Колонки.Добавить("Реферанс", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаРеферансов.Колонки.Добавить("Статус", Новый ОписаниеТипов("Булево"));
	ТаблицаРеферансов.Колонки.Добавить("КолСтарое",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,3)));
	ТаблицаРеферансов.Колонки.Добавить("КолНовое",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,3)));
	ТаблицаРеферансов.Колонки.Добавить("Комментарий", Новый ОписаниеТипов("Строка"));
	
	Для Каждого СтрокаСтатус из ТаблицаСтатусов Цикл
		СтрокаРеферанса = ТаблицаРеферансов.Добавить();
		СтрокаРеферанса.ЗаказДокумент = Документы.ЗаказПоставщику.ПолучитьСсылку(СтрокаСтатус.Заявка);
		СтрокаРеферанса.Реферанс = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",СтрокаСтатус.Артикул);
		СтрокаРеферанса.Статус = СтрокаСтатус.Статус;
		СтрокаРеферанса.КолСтарое = СтрокаСтатус.КолСтарое;
		СтрокаРеферанса.КолНовое = СтрокаСтатус.КолНовое;
		СтрокаРеферанса.Комментарий = СтрокаСтатус.Комментарий;
	КонецЦикла;
	
	Если ТаблицаРеферансов.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица.ЗаказДокумент,
		|	Таблица.Реферанс,
		|	Таблица.Статус,
		|	Таблица.КолСтарое,
		|	Таблица.КолНовое,
		|	Таблица.Комментарий
		|ПОМЕСТИТЬ ВТ_Таблица
		|ИЗ
		|	&Таблица КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Renault_ИсторияИзмененияЗаказПоставщику.ЗаказПоставщику КАК ЗаказПоставщику,
		|	Renault_ИсторияИзмененияЗаказПоставщику.Реферанс,
		|	Renault_ИсторияИзмененияЗаказПоставщику.Количество,
		|	ВТ_Таблица.Статус,
		|	ВТ_Таблица.КолСтарое,
		|	ВТ_Таблица.КолНовое,
		|	ВТ_Таблица.Комментарий
		|ИЗ
		|	ВТ_Таблица КАК ВТ_Таблица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ИсторияИзмененияЗаказПоставщику КАК Renault_ИсторияИзмененияЗаказПоставщику
		|		ПО ВТ_Таблица.ЗаказДокумент = Renault_ИсторияИзмененияЗаказПоставщику.ЗаказПоставщику
		|			И ВТ_Таблица.Реферанс = Renault_ИсторияИзмененияЗаказПоставщику.Реферанс
		|ИТОГИ ПО
		|	ЗаказПоставщику";
		Запрос.УстановитьПараметр("Таблица", ТаблицаРеферансов);
		
		РезультатПоГруппам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока РезультатПоГруппам.Следующий() Цикл
			ДокОбъект = РезультатПоГруппам.ЗаказПоставщику.ПолучитьОБъект();
			Выборка = РезультатПоГруппам.Выбрать();
			Пока Выборка.Следующий() Цикл
				СтрокаТЧ = ДокОбъект.Товары.Найти(Выборка.Реферанс, "Номенклатура");
				Если СтрокаТЧ <> Неопределено и Выборка.Количество <> 0 Тогда
					СтрокаТЧ.Количество = Выборка.Количество;
				ИначеЕсли СтрокаТЧ <> Неопределено и Выборка.Количество = 0 Тогда
					ДокОбъект.Товары.Удалить(СтрокаТЧ);
				КонецЕсли;
				Менеджер = РегистрыСведений.Renault_ИсторияИзмененияЗаказПоставщику.СоздатьМенеджерЗаписи();
				Менеджер.ЗаказПоставщику = РезультатПоГруппам.ЗаказПоставщику;
				Менеджер.Реферанс = Выборка.Реферанс;
				Менеджер.Прочитать();
				Менеджер.Состояние = Выборка.Статус;
				Если Выборка.Комментарий <> "" Тогда
					Менеджер.Коментарий = Менеджер.Коментарий + Символы.ПС+Формат(ТекущаяДата(),"ДЛФ=D")+": "+ Выборка.Комментарий;
				КонецЕсли;
				Если Выборка.Статус Тогда
					Менеджер.Коментарий = Менеджер.Коментарий + Символы.ПС+Формат(ТекущаяДата(),"ДЛФ=D")+": Подтверждено изменение с "+Выборка.КолСтарое+" на "+ Выборка.КолНовое;
				Иначе
					Менеджер.Коментарий = Менеджер.Коментарий + Символы.ПС+Формат(ТекущаяДата(),"ДЛФ=D")+": Отклонено изменение с "+Выборка.КолСтарое+" на "+ Выборка.КолНовое;
				КонецЕсли;
				Менеджер.Записать();
			КонецЦикла;
			ДокОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаСтатуса",Истина);
			ДокОбъект.Записать(?(ДокОбъект.Товары.Количество() = 0, РежимЗаписиДокумента.ОтменаПроведения, РежимЗаписиДокумента.Проведение));
		КонецЦикла;
		
	КонецЕсли;
	Возврат ложь;
КонецФункции
